lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE1.svd
        <!-- #RST_REG_CAN -->
        <register>
          <name>CAN_CLOCK</name>
          <description>CAN's Clock Control</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0300FFFF</resetMask>
          <fields>
            <!-- CAN_CLOCK.CAN1_BRG -->
            <field>
              <name>CAN1_BRG</name>
              <description>HCLK divider to get CAN1_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CAN1__BRG_</headerEnumName>
                <enumeratedValue><name>div1</name><description>div by 1</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>div by 2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>div4</name><description>div by 4</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>div8</name><description>div by 8</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>div16</name><description>div by 16</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>div32</name><description>div by 32</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>div64</name><description>div by 64</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>div128</name><description>div by 128</description><value>7</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CAN_CLOCK.CAN2_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.CAN_CLOCK.CAN1_BRG">
              <name>CAN2_BRG</name>
              <description>HCLK freq divider to get CAN2_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- CAN_CLOCK.CAN1_CLK_EN -->
            <field>
              <name>CAN1_CLK_EN</name>
              <description>CAN1_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CAN__CAN1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>CAN1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>CAN1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CAN_CLOCK.CAN2_CLK_EN -->
            <field>
              <name>CAN2_CLK_EN</name>
              <description>CAN2_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CAN__CAN2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>CAN2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>CAN2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CAN_CLOCK fields end-->
          </fields>
        </register>
        <!-- TIM_CLOCK -->
        <register>
          <name>TIM_CLOCK</name>
          <description>Timer's Clock Control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #RST_TIM_RMASK -->
          <resetMask>0x07070707</resetMask>
          <fields>
            <!-- TIM_CLOCK.TIM1_BRG -->
            <field>
              <name>TIM1_BRG</name>
              <!-- #RST_TIM1_DESCR -->
              <description>HCLK freq divider to get TIM1_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM1__BRG_</headerEnumName>
                <enumeratedValue><name>div1</name><description>div by 1</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>div by 2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>div4</name><description>div by 4</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>div8</name><description>div by 8</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>div16</name><description>div by 16</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>div32</name><description>div by 32</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>div64</name><description>div by 64</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>div128</name><description>div by 128</description><value>7</value></enumeratedValue>
              </enumeratedValues>              
            </field>
            <!-- TIM_CLOCK.TIM2_BRG -->
            <field derivedFrom="TIM1_BRG">
              <name>TIM2_BRG</name>
              <!-- #RST_TIM2_DESCR -->
              <description>HCLK freq divider to get TIM2_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- #RST_TIM3_BRG -->
            <field derivedFrom="TIM1_BRG">
              <name>TIM3_BRG</name>
              <description>HCLK freq divider to get TIM3_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <!-- TIM_CLOCK.TIM1_CLK_EN -->
            <field>
              <name>TIM1_CLK_EN</name>
              <description>TIM1_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM__TIM1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- TIM_CLOCK.TIM2_CLK_EN -->
            <field>
              <name>TIM2_CLK_EN</name>
              <description>TIM2_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM__TIM2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_TIM3_EN -->
            <field>
              <name>TIM3_CLK_EN</name>
              <description>TIM3_CLOCK enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM__TIM3_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer3 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer3 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- TIM_CLOCK fields end-->
          </fields>
        </register>
        <!-- UART_CLOCK-->
        <register>
          <name>UART_CLOCK</name>
          <description>UART's Clock Control</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #RST_UART_RMASK -->
          <resetMask>0x07070707</resetMask>
          <fields>
            <!-- UART_CLOCK.UART1_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART1_BRG</name>
              <!-- #RST_UART1_DESCR -->
              <description>HCLK freq divider to get UART1_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <!-- UART_CLOCK.UART2_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART2_BRG</name>
              <!-- #RST_UART2_DESCR -->
              <description>HCLK freq divider to get UART2_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- #RST_TIM4_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>TIM4_BRG</name>
              <description>HCLK freq divider to get TIM4_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <!-- #RST_UART3_BRG -->
            <!-- UART_CLOCK.UART1_CLK_EN -->
            <field>
              <name>UART1_CLK_EN</name>
              <description>UART1_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UART__UART1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- UART_CLOCK.UART2_CLK_EN -->
            <field>
              <name>UART2_CLK_EN</name>
              <description>UART2_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UART__UART2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_TIM4_EN -->
            <field>
              <name>TIM4_CLK_EN</name>
              <description>TIM4_CLOCK enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UART__TIM4_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer4 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer4 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_UART3_EN -->
            <!-- UART_CLOCK fields end-->
          </fields>
        </register>
        <!-- SSP_CLOCK -->
        <register>
          <name>SSP_CLOCK</name>
          <description>SSP's Clock Control</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #RST_SSP_RMASK -->
          <resetMask>0x07070707</resetMask>
          <fields>
            <!-- SSP_CLOCK.SSP1_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>SSP1_BRG</name>
              <!-- #RST_SSP1_DESCR -->
              <description>HCLK freq divider to get SSP1_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <!-- #RST_SSP2_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">            
              <name>SSP2_BRG</name>
              <description>HCLK freq divider to get SSP2_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- #RST_SSP3_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>SSP3_BRG</name>
              <description>HCLK freq divider to get SSP3_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <!-- SSP_CLOCK.SSP1_CLK_EN -->
            <field>
              <name>SSP1_CLK_EN</name>
              <description>SSP1_CLOCK Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__SSP__SSP1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_SSP2_EN -->
            <field>
              <name>SSP2_CLK_EN</name>
              <description>SSP2_CLOCK Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__SSP__SSP2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_SSP3_EN -->
            <field>
              <name>SSP3_CLK_EN</name>
              <description>SSP3_CLOCK Enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__SSP__SSP3_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP3 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP3 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- SSP_CLOCK fields end-->
          </fields>
        </register>
