lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE1.svd
        <!-- CLRTX -->
        <register>
          <name>CLRTX</name>
          <description>CLR RXTX by MASK</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
              <name>Pin_%s</name>
              <description>Clear pin to 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_GPIO__PIN_CLRTX_</headerEnumName>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Do nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Set Low level to pin with reg RXTX</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- RDTX -->
        <register>
          <name>RDTX</name>
          <description>Value of RXTX in Port mode</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
              <name>Pin_%s</name>
              <description>Pin data value</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_GPIO__PIN_RDTX_</headerEnumName>
                <enumeratedValue>
                  <name>Low</name>
                  <description>LOW Level Voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>HIGH Level Voltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- GPIO_PORTB -->
    <peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTB</name>
      <!-- #GPIO_B_ADDR -->  
      <baseAddress>0x400B0000</baseAddress>
    </peripheral>
    <!-- GPIO_PORTC -->
    <peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTC</name>
      <!-- #GPIO_C_ADDR -->
      <baseAddress>0x400B8000</baseAddress>
    </peripheral>
    <!-- #GPIO_PORT_D -->
    <peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTD</name>
      <baseAddress>0x400C0000</baseAddress>
    </peripheral>
    <!-- #GPIO_PORT_E -->
    <peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTE</name>
      <baseAddress>0x400C8000</baseAddress>
    </peripheral>
    <!-- #GPIO_PORT_F -->
    <peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTF</name>
      <baseAddress>0x400E8000</baseAddress>
    </peripheral>
    <!-- #GPIO_PORT_G -->
    <!-- #GPIO_PORT_H -->
    <!-- #GPIO_PORT_I -->

    <!-- #MILs -->
    <!-- #ARINKs -->

    <!-- peripherals end-->
  </peripherals>

</device>  
